Tekla.Structures.CatalogInternal.dotcatProfileItemCrossSection_t.CrossSectionNumber
The cross section number.

Tekla.Structures.CatalogInternal.dotcatProfileItemCrossSection_t.CrossSectionLocation
The cross section location.